config/Documents/Переоценка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Переоценка</Name>
			<Comment>Переоценка товара на складе</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииЖНВЛС</xr:Item>
				<xr:Item>InformationRegister.Цены</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПоСтНДСПоСкладам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоПереоценки</Name>
					<Comment>Итоговая по всему документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПослеПереоценки</Name>
					<Comment>Итоговая по всему документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузкиВАптеку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаАптеки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДельтаПереоценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПеремещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузкиВБух</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспоряжениеНаПереоценку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзм</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияНадДокументами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийИзменения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товар</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕИТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕИТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>К</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяПартия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяСуммаРозн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяЦенаРозн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяЦенаРозн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяСуммаРозн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтарыйРознНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйРознНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПартияАптеки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяПартияАптеки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакуп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСЗакуп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неактивная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Бухгалтерия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяСуммаРозн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяСуммаРозн</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтарыйРознНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйРознНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакуп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСЗакуп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/InformationRegisters/НеактивныеПартииПереоценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НеактивныеПартииПереоценки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтараяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АктивнаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НеактивнаяПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/AccumulationRegisters/ПартииЖНВЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииЖНВЛС</Name>
			<Comment>Учет по партиям товаров</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Колво</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСЗакуп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРознСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРознНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/Documents/Переоценка/Ext/ObjectModule.bsl
Функция ВыгрузитьПартииНаАптеку() Экспорт
	
	//==================<Вываливаем файло на аптеку>===================GtG====23.01.2008
	Если Склад.Делфи = Истина Тогда  // Для аптек с новой программой не надо выгружать партии
		Возврат Истина;
	КонецЕсли;
	
	ДБФ= Новый XBase;
	
	ДБФ.поля.Добавить("IDGOOD","N",11,0);
	
	ДБФ.поля.Добавить("IDPROD","N",11,0);
	ДБФ.поля.Добавить("PART_B","S",15,0);
	ДБФ.поля.Добавить("CCARD_B","N",15,0);
	
	
	ДБФ.поля.Добавить("PART_A","S",15,0);
	
	ДБФ.поля.Добавить("CCARD_A","N",15,0);
	
	
	ДБФ.поля.Добавить("QNT","N",10,0);
	
	ДБФ.поля.Добавить("COSTR_B","N",10,2);
	ДБФ.поля.Добавить("COSTR_A","N",10,2);
	ДБФ.поля.Добавить("NDOC","S",20,0);
	ДБФ.поля.Добавить("DDOC","D",,);
	ДБФ.поля.Добавить("ST","N",11,0);
	
	
	
	РезИФ="POF"+сКЛАД.Код+"_"+НомерДокументаАптеки+"_"+Формат(дата,"ДФ=dd.MM.yyyy");
	
	ЗИП=Склад.КаталогОбмена+"\"+РезИФ+".ZIP";
	
	ТМП_ДБФ=ПараметрыСеанса.КАТАЛОГ_ВРЕМЕННЫХ_ФАЙЛОВ+"\POF_TMP.DBf";
	
	Попытка
		ДБФ.СоздатьФайл(ТМП_ДБФ);
	Исключение
		#Если Клиент Тогда
			Сообщить("Ошибка: не удалось создать файл партий переоценки "+ ОписаниеОшибки() );
		#КонецЕсли
		Возврат Ложь;
	КонецПопытки;
	
	Для каждого Стр из Товар Цикл
		
		Если стр.Неактивная = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		ДБФ.Добавить();
		
		ДБФ.PART_B = Стр.Партия.Наименование;
		ДБФ.PART_A = Стр.НоваяПартия.Наименование;
		ДБФ.IDGOOD =  Стр.ЕИТ.Код;
		ДБФ.IDPROD = ""; 
		ДБФ.QNT  = Стр.Количество; 
		ДБФ.COSTR_B = Стр.СтараяЦенаРозн; 
		ДБФ.COSTR_A = Стр.НоваяЦенаРозн; 
		ДБФ.NDOC = НомерДокументаАптеки ;
		ДБФ.DDOC = Дата;
		ДБФ.ST    ="";
		ДБФ.CCARD_B= Стр.ПартияАптеки;
		ДБФ.CCARD_A= Стр.НоваяПартияАптеки;
		ДБФ.Записать();
		
		
	КонецЦикла;	
	
	ДБФ.ЗакрытьФайл();
	
	//==================<Зипанем и копирнем в каталог ФТП>===================GtG====22.01.2008
	Попытка
		ПереместитьФайл(ТМП_ДБФ,ПараметрыСеанса.КАТАЛОГ_ВРЕМЕННЫХ_ФАЙЛОВ+"\"+РезИф+".DBF");
		
		ОМ17_ЗапаковатьФайлИСкопироватьЕгоВПапку(ПараметрыСеанса.КАТАЛОГ_ВРЕМЕННЫХ_ФАЙЛОВ+"\"+РезИф+".DBF",ЗИП);
		
		УдалитьФайлы(ПараметрыСеанса.КАТАЛОГ_ВРЕМЕННЫХ_ФАЙЛОВ+"\"+РезИф+".DBF");
	Исключение
		#Если Клиент Тогда
			Сообщить("Ошибка: выгрузка партий переоценки "+ ОписаниеОшибки() );
		#КонецЕсли
		Возврат Ложь;
	КонецПопытки;
	
	#Если Клиент Тогда
		Состояние("Выгружен на FTP "+зип);
	#КонецЕсли
	Возврат Истина;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Переоценка тогвара по регистрам и выгрузка файла на фтп
	
//==================<По партиям>===================GtG====23.01.2008
Ненашли = Товар.Найти(Истина,"Неактивная");	
Если Не Ненашли = неопределено  Тогда
	ТХТ = "ВЫБРАТЬ
	|	ПереоценкаТовар.Партия,
	|	ПереоценкаТовар.НоваяПартия,
	|	1 КАК Активная
	|ПОМЕСТИТЬ Активные
	|ИЗ
	|	Документ.Переоценка.Товар КАК ПереоценкаТовар
	|ГДЕ
	|	ПереоценкаТовар.Ссылка = &Ссылка
	|	И ПереоценкаТовар.Неактивная = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПереоценкаТовар.Партия,
	|	ПереоценкаТовар.НоваяПартия,
	|	0 КАК Активная
	|ПОМЕСТИТЬ НЕАктивные
	|ИЗ
	|	Документ.Переоценка.Товар КАК ПереоценкаТовар
	|ГДЕ
	|	ПереоценкаТовар.Ссылка = &Ссылка
	|	И ПереоценкаТовар.Неактивная = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Активные.Партия КАК СтараяПартия,
	|	Активные.НоваяПартия КАК АктивнаяПартия,
	|	Неактивные.НоваяПартия КАК НеактивнаяПартия
	|ИЗ
	|	Активные КАК Активные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НЕАктивные КАК Неактивные
	|		ПО Активные.Партия = Неактивные.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Активные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеАктивные";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТХТ;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Рез = Запрос.Выполнить().Выгрузить();
	МЗ = РегистрыСведений.НеактивныеПартииПереоценки.СоздатьМенеджерЗаписи();
	Для каждого стр из Рез  Цикл
		МЗ.СтараяПартия = стр.СтараяПартия ;
		МЗ.АктивнаяПартия = стр.АктивнаяПартия ;
		МЗ.НеактивнаяПартия = стр.НеактивнаяПартия ;
		МЗ.Прочитать();
		
		МЗ.СтараяПартия = стр.СтараяПартия ;
		МЗ.АктивнаяПартия = стр.АктивнаяПартия ;
		МЗ.НеактивнаяПартия = стр.НеактивнаяПартия ;
		МЗ.Записать();			
		
	КонецЦикла;
	                        
	
	
КонецЕсли;

ДП=Движения.ПартииЖНВЛС;

Для каждого Стр из ТОвар Цикл
	
	//==================<Списание строй партии>===================GtG====23.01.2008
	Если стр.Неактивная = Истина Тогда
		Продолжить;
	КонецЕсли;
	ДВ=ДП.Добавить();
	ДВ.Активность=Истина;
	ДВ.ВидДвижения=ВидДвиженияНакопления.Расход;
	ДВ.ВидОперации=Перечисления.ВидыОпераций.Переоценка;
	ДВ.Колво=Стр.Количество*Стр.К;
	ДВ.Партия=Стр.Партия;
	ДВ.Период=Дата;
	ДВ.Регистратор= ЭтотОбъект;
	ДВ.Склад=Склад;
	ДВ.СтавкаНДС=Стр.СтавкаНДС;
	ДВ.СуммаЗакупСНДС=Стр.СуммаЗакуп;
	ДВ.СуммаНДСЗакуп =Стр.НДСЗакуп;
	ДВ.СуммаРознНДС=Стр.СтарыйРознНДС;
	ДВ.СуммаРознСНДС=Стр.СтараяСуммаРозн;
	ДВ.Товар=Стр.Товар;
	ДВ.Фирма=Фирма;
	//==================<Приход новой>===================GtG====23.01.2008
	
	ДВ=ДП.Добавить();
	ДВ.Активность=Истина;
	ДВ.ВидДвижения=ВидДвиженияНакопления.Приход;
	ДВ.ВидОперации=Перечисления.ВидыОпераций.Переоценка;
	ДВ.Колво=Стр.Количество*Стр.К;
	ДВ.Партия=Стр.НоваяПартия;
	ДВ.Период=Дата;
	ДВ.Регистратор= ЭтотОбъект;
	ДВ.Склад=Склад;
	ДВ.СтавкаНДС=Стр.СтавкаНДС;
	ДВ.СуммаЗакупСНДС=Стр.СуммаЗакуп;
	ДВ.СуммаНДСЗакуп =Стр.НДСЗакуп;
	ДВ.СуммаРознНДС=Стр.НовыйРознНДС;
	ДВ.СуммаРознСНДС=Стр.НоваяСуммаРозн;
	ДВ.Товар=Стр.Товар;
	ДВ.Фирма=Фирма;
КонецЦикла;	 
//ДП.Записать();

ДБ=Движения.ОстаткиПоСтНДСПоСкладам;

Для каждого Стр из Бухгалтерия Цикл
	
	
	ДВ=ДБ.Добавить();
	
	
	Дельточка=Стр.НоваяСуммаРозн-Стр.СтараяСуммаРозн;
	
	
	
	
	
	ДВ.Активность=Истина;
	Если Дельточка<0 Тогда // уценка
		ДВ.ВидДвижения=ВидДвиженияНакопления.Расход;
		ДВ.СуммаРознСНДС=(-1)*Дельточка;
		ДВ.СуммаРознНДС=(-1)*(Стр.НовыйРознНДС-Стр.СтарыйРознНДС);
	Иначе // донаценка
		ДВ.ВидДвижения=ВидДвиженияНакопления.Приход;
		ДВ.СуммаРознСНДС=Дельточка;
		ДВ.СуммаРознНДС=Стр.НовыйРознНДС-Стр.СтарыйРознНДС;
	КонецЕсли; 	
	
	ДВ.ВидОперации=Перечисления.ВидыОпераций.Переоценка;
	ДВ.Период=ДАта;
	ДВ.Регистратор= ЭтотОбъект;
	ДВ.Склад=Склад;
	ДВ.СтавкаНДС=Стр.СтавкаНДС;
	ДВ.Фирма=Фирма;
КонецЦикла;	

//ДБ.Записать();


	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Бухгалтерия.Очистить();

	Отбор = Новый Структура("Неактивная",Ложь);
	
	ТЗБ=Товар.Выгрузить(Отбор,"СтавкаНДС,СтараяСуммаРозн,НоваяСуммаРозн,СтарыйРознНДС,НовыйРознНДС,СуммаЗакуп,НДСЗакуп" );
	
	ТЗБ.Свернуть("СтавкаНДС","СтараяСуммаРозн,НоваяСуммаРозн,СтарыйРознНДС,НовыйРознНДС,СуммаЗакуп,НДСЗакуп" );
	
	Для каждого Стр из ТЗБ Цикл
		СтрБ=Бухгалтерия.Добавить();
		СтрБ.НоваяСуммаРозн=Стр.НоваяСуммаРозн;
		СтрБ.НовыйРознНДС=Стр.НовыйРознНДС;
		СтрБ.СтавкаНДС=Стр.СтавкаНДС;
		СтрБ.СтараяСуммаРозн=Стр.СтараяСуммаРозн;
		СтрБ.СтарыйРознНДС=Стр.СтарыйРознНДС;
		СтрБ.СуммаЗакуп=Стр.СуммаЗакуп;
		СтрБ.НДСЗакуп=Стр.НДСЗакуп;
	КонецЦикла;	
	
	СуммаДоПереоценки=ТЗБ.Итог("СтараяСуммаРозн");
	СуммаПослеПереоценки=ТЗБ.Итог("НоваяСуммаРозн");
	ДельтаПереоценки=СуммаПослеПереоценки-СуммаДоПереоценки;
	
	ЗаписатьДействияВИсториюДокумента(Изменения,РежимЗаписи,ПометкаУдаления);	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОМ41_ПередУдалениемДокумента  (ЭтотОбъект,Отказ);
	
КонецПроцедуры
